; domain
(define (domain rescue-drone)

    (:requirements :strips :negative-preconditions)

    (:predicates
        (position ?P) ; P is a valid coordinate position (assuming square grid)
        (inc ?P ?PP) ; PP is greater coordinate than P
        (safe-zone ?X ?Y) ; The safe zone is at coordinates (X, Y)
        (obstacle ?X ?Y) ; There is an obstacle at coordinates (X, Y)
        (person-location ?X ?Y) ; There is a person at coordinates (X, Y)
        (drone-location ?X ?Y) ; The drone is at coordinates (X, Y)
        (empty-drone) ; The drone is not carrying a person
        (spot ?S) ; S is a valid spot of the safe zone
        (free-spot ?S) ; The spot S of the safe zone is free
    )

    (:action up
        :parameters (?X ?Y ?NY)

        :precondition (and
            (position ?X) (position ?Y) (position ?NY)
            (inc ?NY ?Y)
            (drone-location ?X ?Y)
            (not (obstacle ?X ?NY))
        )

        :effect (and
            (drone-location ?X ?NY)
            (not (drone-location ?X ?Y))
        )
    )

    (:action down
        :parameters (?X ?Y ?NY)

        :precondition (and
            (position ?X) (position ?Y) (position ?NY)
            (inc ?Y ?NY)
            (drone-location ?X ?Y)
            (not (obstacle ?X ?NY))
        )

        :effect (and
            (drone-location ?X ?NY)
            (not (drone-location ?X ?Y))
        )
    )

    (:action right
        :parameters (?X ?Y ?NX)

        :precondition (and
            (position ?X) (position ?Y) (position ?NX)
            (inc ?X ?NX)
            (drone-location ?X ?Y)
            (not (obstacle ?NX ?Y))
        )

        :effect (and
            (drone-location ?NX ?Y)
            (not (drone-location ?X ?Y))
        )
    )

    (:action left
        :parameters (?X ?Y ?NX)

        :precondition (and
            (position ?X) (position ?Y) (position ?NX)
            (inc ?NX ?X)
            (drone-location ?X ?Y)
            (not (obstacle ?NX ?Y))
        )

        :effect (and
            (drone-location ?NX ?Y)
            (not (drone-location ?X ?Y))
        )
    )

    (:action pick-up
        :parameters (?X ?Y)

        :precondition (and
            (position ?X) (position ?Y)
            (drone-location ?X ?Y)
            (person-location ?X ?Y)
            (empty-drone)
        )

        :effect (and
            (not (person-location ?X ?Y))
            (not (empty-drone))
        )
    )

    (:action drop-off
        :parameters (?X ?Y ?S)

        :precondition (and
            (position ?X) (position ?Y)
            (drone-location ?X ?Y)
            (not (empty-drone))
            (safe-zone ?X ?Y)
            (spot ?S) (free-spot ?S)
        )

        :effect (and
            (empty-drone)
            (person-location ?X ?Y)
            (not (free-spot ?S))
        )
    )

    (:action evacuate-safe-zone
        :parameters (?S)

        :precondition (and
            (spot ?S)
            (not (free-spot ?S))
        )

        :effect (free-spot ?S)
    )

)

; problem
(define (problem pb6)

    (:domain rescue-drone)

    (:objects
        P1 P2 P3 P4 P5 S1 S2 S3 S4
    )

    (:init
        (position P1)
        (position P2)
        (position P3)
        (position P4)
        (position P5)

        (inc P1 P2)
        (inc P2 P3)
        (inc P3 P4)
        (inc P4 P5)

        (safe-zone P3 P3)

        (spot S1)
        (spot S2)
        (spot S3)
        (spot S4)

        (free-spot S1)
        (free-spot S2)
        (free-spot S3)
        (free-spot S4)

        (person-location P1 P1)
        (person-location P5 P1)
        (person-location P1 P3)
        (person-location P5 P3)
        (person-location P3 P5)

        (obstacle P1 P2)
        (obstacle P2 P2)
        (obstacle P3 P2)
        (obstacle P4 P2)

        (obstacle P2 P4)
        (obstacle P3 P4)
        (obstacle P4 P4)
        (obstacle P5 P4)

        (drone-location P5 P5)
        (empty-drone)
    )

    (:goal
        (and
            (not (person-location P1 P1))
            (not (person-location P5 P1))
            (not (person-location P1 P3))
            (not (person-location P5 P3))
            (not (person-location P3 P5))
            (person-location P3 P3)
            (empty-drone))
    )
)

; plan
1. (left p5 p5 p4)
   deleted: (drone-location p5 p5)
   added: (drone-location p4 p5)
   goals met: 1 of 7
2. (left p4 p5 p3)
   deleted: (drone-location p4 p5)
   added: (drone-location p3 p5)
   goals met: 1 of 7
3. (pick-up p3 p5)
   deleted: (person-location p3 p5) (empty-drone)
   goals met: 1 of 7
4. (left p3 p5 p2)
   deleted: (drone-location p3 p5)
   added: (drone-location p2 p5)
   goals met: 1 of 7
5. (left p2 p5 p1)
   deleted: (drone-location p2 p5)
   added: (drone-location p1 p5)
   goals met: 1 of 7
6. (up p1 p5 p4)
   deleted: (drone-location p1 p5)
   added: (drone-location p1 p4)
   goals met: 1 of 7
7. (up p1 p4 p3)
   deleted: (drone-location p1 p4)
   added: (drone-location p1 p3)
   goals met: 1 of 7
8. (right p1 p3 p2)
   deleted: (drone-location p1 p3)
   added: (drone-location p2 p3)
   goals met: 1 of 7
9. (right p2 p3 p3)
   deleted: (drone-location p2 p3)
   added: (drone-location p3 p3)
   goals met: 1 of 7
10. (drop-off p3 p3 s1)
   deleted: (free-spot s1)
   added: (empty-drone) (person-location p3 p3)
   goals met: 3 of 7
11. (left p3 p3 p2)
   deleted: (drone-location p3 p3)
   added: (drone-location p2 p3)
   goals met: 3 of 7
12. (left p2 p3 p1)
   deleted: (drone-location p2 p3)
   added: (drone-location p1 p3)
   goals met: 3 of 7
13. (pick-up p1 p3)
   deleted: (person-location p1 p3) (empty-drone)
   goals met: 3 of 7
14. (right p1 p3 p2)
   deleted: (drone-location p1 p3)
   added: (drone-location p2 p3)
   goals met: 3 of 7
15. (right p2 p3 p3)
   deleted: (drone-location p2 p3)
   added: (drone-location p3 p3)
   goals met: 3 of 7
16. (drop-off p3 p3 s2)
   deleted: (free-spot s2)
   added: (empty-drone)
   goals met: 4 of 7
17. (right p3 p3 p4)
   deleted: (drone-location p3 p3)
   added: (drone-location p4 p3)
   goals met: 4 of 7
18. (right p4 p3 p5)
   deleted: (drone-location p4 p3)
   added: (drone-location p5 p3)
   goals met: 4 of 7
19. (up p5 p3 p2)
   deleted: (drone-location p5 p3)
   added: (drone-location p5 p2)
   goals met: 4 of 7
20. (up p5 p2 p1)
   deleted: (drone-location p5 p2)
   added: (drone-location p5 p1)
   goals met: 4 of 7
21. (left p5 p1 p4)
   deleted: (drone-location p5 p1)
   added: (drone-location p4 p1)
   goals met: 4 of 7
22. (left p4 p1 p3)
   deleted: (drone-location p4 p1)
   added: (drone-location p3 p1)
   goals met: 4 of 7
23. (left p3 p1 p2)
   deleted: (drone-location p3 p1)
   added: (drone-location p2 p1)
   goals met: 4 of 7
24. (left p2 p1 p1)
   deleted: (drone-location p2 p1)
   added: (drone-location p1 p1)
   goals met: 4 of 7
25. (pick-up p1 p1)
   deleted: (person-location p1 p1) (empty-drone)
   goals met: 4 of 7
26. (right p1 p1 p2)
   deleted: (drone-location p1 p1)
   added: (drone-location p2 p1)
   goals met: 4 of 7
27. (right p2 p1 p3)
   deleted: (drone-location p2 p1)
   added: (drone-location p3 p1)
   goals met: 4 of 7
28. (right p3 p1 p4)
   deleted: (drone-location p3 p1)
   added: (drone-location p4 p1)
   goals met: 4 of 7
29. (right p4 p1 p5)
   deleted: (drone-location p4 p1)
   added: (drone-location p5 p1)
   goals met: 4 of 7
30. (down p5 p1 p2)
   deleted: (drone-location p5 p1)
   added: (drone-location p5 p2)
   goals met: 4 of 7
31. (down p5 p2 p3)
   deleted: (drone-location p5 p2)
   added: (drone-location p5 p3)
   goals met: 4 of 7
32. (left p5 p3 p4)
   deleted: (drone-location p5 p3)
   added: (drone-location p4 p3)
   goals met: 4 of 7
33. (left p4 p3 p3)
   deleted: (drone-location p4 p3)
   added: (drone-location p3 p3)
   goals met: 4 of 7
34. (drop-off p3 p3 s3)
   deleted: (free-spot s3)
   added: (empty-drone)
   goals met: 5 of 7
35. (evacuate-safe-zone s1)
   added: (free-spot s1)
   goals met: 5 of 7
36. (right p3 p3 p4)
   deleted: (drone-location p3 p3)
   added: (drone-location p4 p3)
   goals met: 5 of 7
37. (right p4 p3 p5)
   deleted: (drone-location p4 p3)
   added: (drone-location p5 p3)
   goals met: 5 of 7
38. (pick-up p5 p3)
   deleted: (person-location p5 p3) (empty-drone)
   goals met: 5 of 7
39. (left p5 p3 p4)
   deleted: (drone-location p5 p3)
   added: (drone-location p4 p3)
   goals met: 5 of 7
40. (left p4 p3 p3)
   deleted: (drone-location p4 p3)
   added: (drone-location p3 p3)
   goals met: 5 of 7
41. (drop-off p3 p3 s1)
   deleted: (free-spot s1)
   added: (empty-drone)
   goals met: 6 of 7
42. (right p3 p3 p4)
   deleted: (drone-location p3 p3)
   added: (drone-location p4 p3)
   goals met: 6 of 7
43. (right p4 p3 p5)
   deleted: (drone-location p4 p3)
   added: (drone-location p5 p3)
   goals met: 6 of 7
44. (up p5 p3 p2)
   deleted: (drone-location p5 p3)
   added: (drone-location p5 p2)
   goals met: 6 of 7
45. (up p5 p2 p1)
   deleted: (drone-location p5 p2)
   added: (drone-location p5 p1)
   goals met: 6 of 7
46. (pick-up p5 p1)
   deleted: (person-location p5 p1) (empty-drone)
   goals met: 6 of 7
47. (down p5 p1 p2)
   deleted: (drone-location p5 p1)
   added: (drone-location p5 p2)
   goals met: 6 of 7
48. (down p5 p2 p3)
   deleted: (drone-location p5 p2)
   added: (drone-location p5 p3)
   goals met: 6 of 7
49. (left p5 p3 p4)
   deleted: (drone-location p5 p3)
   added: (drone-location p4 p3)
   goals met: 6 of 7
50. (left p4 p3 p3)
   deleted: (drone-location p4 p3)
   added: (drone-location p3 p3)
   goals met: 6 of 7
51. (drop-off p3 p3 s4)
   deleted: (free-spot s4)
   added: (empty-drone)
   goals met: 7 of 7
